// Step6. 스핀박스 만들기
//---------------

// 아래 스펙대로 스핀박스를 만들어주세요.
// - 스핀박스의 텍스트 상자에는 기본적으로 200 이 들어가게 해주세요.
// - ▲ 버튼을 누르면(mousedown) 숫자는 1이 증가하고,
//   ▼ 버튼을 누르면 숫자는 1이 감소합니다.
// - 숫자의 증감은 100~300 사이의 범위에서만 바뀌도록 합니다.
// - 텍스트 상자에는 사용자가 숫자를 직접 입력할 수 있으며,
//   포커스 아웃(blur)시에 숫자 외의 글자는 모두 지워지게 해주세요.
//   (만약 ab12c3 라고 입력했다면 123 만 남습니다)
// - 텍스트 상자에 사용자가 직접 입력한 숫자가 100~300 범위를 벗어나면,
//   포커스 아웃(blur)시에 100 미만 일때는 100 으로,
//   300 초과 일때는 300 으로 설정되게 해주세요.
// - ▲ 버튼 또는 ▼ 버튼를 누르고 있으면,
//   처음 누르기 시작한지 0.5초 후부터 0.1초마다 1 씩 증감하도록 해주세요.



